Revit 2026 API

# MetalMetalPerforationsCenter Property

---

The property labeled "Center Spacing" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPerforationsCenter { get; }
```
```vb
Public Shared ReadOnly Property MetalPerforationsCenter As String
	Get
```
```cpp
public:
static property String^ MetalPerforationsCenter {
	String^ get ();
}
```
```fsharp
static member MetalPerforationsCenter : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" with a minimum of "0.0001".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace